
export interface EducationService {
  name: string;
}

export interface EducationSubCategory {
  name:string;
  items: EducationService[];
}

export interface EducationCategory {
  name: string;
  icon: string;
  items?: EducationService[];
  subCategories?: EducationSubCategory[];
}

export const educationServicesData: EducationCategory[] = [
  {
    name: 'الجامعات الحكومية',
    icon: 'fas fa-university',
    items: [
        { name: 'رسوم جامعة حلوان' },
        { name: 'رسوم جامعة الاسكندرية' },
        { name: 'رسوم جامعة عين شمس' },
        { name: 'رسوم جامعة القاهرة' },
        { name: 'رسوم جامعة طنطا' },
        { name: 'رسوم جامعة كفر الشيخ' },
        { name: 'رسوم جامعة الفيوم' },
        { name: 'رسوم جامعة المنوفية' },
        { name: 'رسوم جامعة المنصورة' },
        { name: 'رسوم جامعة الزقازيق' },
        { name: 'رسوم جامعة بنها' },
        { name: 'رسوم جامعة قناة السويس' },
        { name: 'رسوم جامعة سوهاج' },
        { name: 'رسوم جامعة أسيوط' },
        { name: 'رسوم جامعة جنوب الوادي' },
        { name: 'رسوم جامعة بني سويف' },
        { name: 'رسوم جامعة دمنهور' },
        { name: 'رسوم جامعة بورسعيد' },
        { name: 'رسوم جامعة الأقصر' },
        { name: 'رسوم جامعة دمياط' },
        { name: 'رسوم جامعة السادات' },
        { name: 'رسوم جامعة العريش' },
        { name: 'رسوم جامعة مطروح' },
    ],
  },
  {
    name: 'الجامعات والمؤسسات الخاصة',
    icon: 'fas fa-building',
    items: [
        { name: 'رسوم مدينة الثقافة والعلوم' },
        { name: 'رسوم أكاديمية الشروق' },
        { name: 'رسوم الأكاديمية العربية للعلوم والتكنولوجيا والنقل البحري' },
        { name: 'رسوم جامعة 6 أكتوبر' },
        { name: 'رسوم جامعة بدر' },
        { name: 'رسوم جامعة النيل' },
        { name: 'رسوم الجامعة الفرنسية' },
        { name: 'رسوم جامعة الأهرام الكندية' },
        { name: 'رسوم الجامعة المصرية الروسية' },
        { name: 'رسوم جامعة مصر الدولية' },
        { name: 'رسوم جامعة دراية' },
        { name: 'رسوم جامعة هليوبوليس' },
        { name: 'رسوم جامعة نيو جيزة' },
        { name: 'رسوم جامعة المستقبل' },
        { name: 'رسوم جامعة مصر للعلوم والتكنولوجيا' },
        { name: 'رسوم جامعة الدلتا' },
        { name: 'رسوم الجامعة البريطانية في مصر' },
        { name: 'رسوم جامعة النهضة' },
        { name: 'رسوم جامعة MTI' },
    ],
  },
  {
    name: 'خدمات التعليم الأخرى',
    icon: 'fas fa-graduation-cap',
    subCategories: [
      {
        name: 'المصروفات الدراسية',
        items: [
            { name: 'المصروفات الدراسية للعام السابق' },
            { name: 'المصروفات الدراسية للعام الحالي' },
            { name: 'تقسيط المصروفات الدراسية للعام السابق' },
            { name: 'تقسيط المصروفات الدراسية للعام الحالي' },
        ],
      },
      {
        name: 'خدمات الامتحانات والشهادات',
        items: [
            { name: 'خدمة تطبيقات الشهادة الثانوية' },
            { name: 'رسوم امتحانات وزارة التربية والتعليم' },
            { name: 'رسوم هيئة الامتحانات لطلاب التعليم الفني' },
            { name: 'امتحانات المواد القومية لطلاب الشهادات الدولية' },
            { name: 'رسوم التنسيق والتظلمات والتحويل الالكتروني' },
        ],
      },
      {
        name: 'خدمات التعليم الفني والمتخصص',
        items: [
            { name: 'رسوم طلاب دبلوم مدارس التكنولوجيا التطبيقية' },
            { name: 'مصروفات التعليم الفني نظام 3 سنوات' },
            { name: 'رسم ملف التقديم لطلاب التعليم والتدريب المزدوج' },
        ],
      },
      {
        name: 'خدمات المدارس المتخصصة',
        items: [
            { name: 'المدارس اليابانية - الرسوم الدراسية' },
            { name: 'تحصيل مصاريف مدارس المتفوقين' },
            { name: 'مصاريف المدارس - الصفوف الأولى' },
            { name: 'رسوم التقديم لمدارس مراكز التميز' },
            { name: 'رسوم التقديم لمدارس التجريبية' },
        ],
      },
      {
        name: 'خدمات أخرى',
        items: [
            { name: 'دفع غرامة الشباب لثاني مرة' },
            { name: 'دفع غرامة الشباب لأول مرة' },
            { name: 'دفع غرامة القيد بسبب استنفاذ مرات الرسوب' },
            { name: 'رسوم اعادة القيد بسبب استنفاذ مرات الرسوب' },
            { name: 'رسم استمارة نقل من الخارج لطلاب المنازل' },
        ],
      },
    ],
  },
];
