
export interface GovernmentService {
  name: string;
}

export const governmentServicesData: GovernmentService[] = [
  { name: 'بوابة مصر الرقمية' },
  { name: 'توصيل مخالفات منزلي' },
  { name: 'وزارة التضامن الاجتماعي - رسوم التقييم الوظيفي للخدمات المتكاملة' },
  { name: 'الغرفة التجارية بالقاهرة' },
  { name: 'وزارة التضامن - استمارة الكشف الوظائفي' },
  { name: 'السجلات العسكرية' },
  { name: 'مخالفات المرور ق.م' },
  { name: 'التجنيد والتعبئة' },
  { name: 'ضرائب ورسوم وتأمين المرور' },
  { name: 'مشروع الاسكان الإجتماعي' },
  { name: 'استلام الرخصة من المنزل' },
  { name: 'رسوم طلب حج القرعه' },
  { name: 'رويال للتأمين الإجباري (القاهرة والجيزة)' },
  { name: 'بيت التامين المصري السعودي (القاهرة و الجيزة)' },
];