
export interface LoanService {
  name: string;
}

export interface LoanCategory {
  name: string;
  icon: string;
  items: LoanService[];
}

export const installmentsLoansServicesData: LoanCategory[] = [
  {
    name: 'البنوك والمؤسسات المالية',
    icon: 'fas fa-university',
    items: [
      { name: 'البنك الأهلي - القرض العقاري' },
      { name: 'بنك ابو ظبي الاسلامي - اقساط التمويل' },
      { name: 'مرابحات بنك ابوظبي الاسلامي' },
      { name: 'بنك التعمير و الاسكان - جنوب سيناء' },
      { name: 'قروض بنك أى بي سي ABC' },
      { name: 'ابوظبي الإسلامي للتمويل الاستهلاكي – تكه' },
      { name: 'الاهلى للتمويل العقارى' },
    ],
  },
  {
    name: 'شركات التمويل',
    icon: 'fas fa-building',
    items: [
      { name: 'شركة املاك للتمويل' },
      { name: 'فينبى للتمويل' },
      { name: 'ثقه للتمويل - سلفة' },
      { name: 'سندة للتمويل المتناهي الصغر' },
      { name: 'انجاز للتمويل المتناهي الصغر' },
      { name: 'مكسب للتمويل متناهي الصغر' },
      { name: 'شاري للتمويل متناهي الصغر' },
      { name: 'رواج للتمويل الإستهلاكي' },
      { name: 'أمان للتنمية و التمويل' },
      { name: 'مدفوعات درايف للتمويل' },
      { name: 'التمويل الأخضر' },
    ],
  },
  {
    name: 'الجمعيات والمؤسسات',
    icon: 'fas fa-users',
    items: [
      { name: 'اقساط وقروض تعاونيات البناء والاسكان' },
      { name: 'تحصيلات جمعية أسوان للتمويل' },
      { name: 'جمعية المرأة للتنمية الانسانية' },
      { name: 'جمعية رابطة المرأة العربية' },
      { name: 'جمعية المستقبل للتمويل الأصغر' },
      { name: 'جمعية الرؤية الجديدة للتمويل' },
      { name: 'المبادرة للتمويل متناهي الصغر ببني هاني' },
      { name: 'جمعية ريديك قنا' },
      { name: 'الجمعيه المصريه لرعاية أطفال الشوارع' },
      { name: 'جمعية شباب مصر بالفيوم' },
      { name: 'جمعية الأسرة المصرية - أسوان' },
      { name: 'جمعيه الجيزة' },
      { name: 'جمعية سيدات اعمال المنيا' },
      { name: 'تحصيلات جمعية ريديك قنا-3' },
      { name: 'جمعيه شروق مصر فرع اسيوط' },
      { name: 'تحصيلات جمعية ريديك قنا-2' },
      { name: 'تحصيلات جمعية شروق مصر' },
    ],
  },
  {
    name: 'خدمات أخرى',
    icon: 'fas fa-ellipsis-h',
    items: [
      { name: 'تحصيلات فرصة' },
      { name: 'تحصيلات جروب' },
      { name: 'بلنك - الأقساط المستحقة' },
      { name: 'بلنك - سداد كلي للقرض' },
      { name: 'بلنك - تسجيل طلبات' },
      { name: 'تمويل فوري (علي السريع) 26101' },
      { name: 'مشروع بدايتى للإقراض (73144)' },
      { name: 'قسط تامين حياة - جى اى جى (حياة تكافل)' },
      { name: 'تحصيلات كاريتاس مصر' },
      { name: 'تحصيل ميد تقسيط' },
      { name: 'تحصيلات قروض المشرق' },
      { name: 'مؤسسة تضامن 2024' },
      { name: 'إيداع عربون قناة السويس لتأمينات الحياة' },
    ],
  },
];