
export interface UtilityService {
  name: string;
}

export interface UtilityCategory {
  name: string;
  icon: string; // Using Font Awesome icons
  items: UtilityService[];
  type?: 'list' | 'reader';
}

export const utilityServicesData: UtilityCategory[] = [
  {
    name: 'فواتير الكهرباء',
    icon: 'fas fa-bolt',
    items: [
      { name: 'كهرباء شمال القاهرة' },
      { name: 'كهرباء جنوب القاهرة' },
      { name: 'كهرباء القناة' },
      { name: 'كهرباء الاسكندرية' },
      { name: 'كهرباء شمال الدلتا' },
      { name: 'كهرباء جنوب الدلتا' },
      { name: 'كهرباء مصر الوسطى' },
      { name: 'كهرباء مصر العليا' },
      { name: 'كهرباء البحيرة' },
      { name: 'شحن طاقة للكهرباء - اسكرا' },
      { name: 'سداد طاقة للكهرباء - اخرى' },
      { name: 'مدفوعات فاتورة العدادات الذكية' },
    ],
  },
  {
    name: 'فواتير المياه',
    icon: 'fas fa-tint',
    items: [
      { name: 'مياه البحر الأحمر' },
      { name: 'مياه بني سويف' },
      { name: 'مياه الإسكندرية' },
      { name: 'مياه القاهرة' },
      { name: 'مياه سوهاج' },
      { name: 'مياه شمال سيناء' },
      { name: 'مياه جنوب سيناء' },
      { name: 'مياه كفر الشيخ' },
      { name: 'مياه البحيرة' },
      { name: 'مياه مدينة العبور' },
      { name: 'مياه مدينة 6 أكتوبر' },
      { name: 'مياه القاهرة الجديدة' },
      { name: 'مياه دمياط الجديدة' },
      { name: 'مياه القليوبية' },
      { name: 'مياه مدن القناة' },
      { name: 'مياه الشرقية' },
      { name: 'مياه العاشر من رمضان' },
      { name: 'هيئة قناة السويس - سداد فواتير هيئة قناة السويس' },
      { name: 'مياه مدينة الشروق' },
      { name: 'فاتورة مياه بدر' },
      { name: 'مياه مطروح' },
      { name: 'تحصيلات مياه الغربية' },
      { name: 'مياه جهاز المنيا الجديدة' },
      { name: 'مياه الشرب والصرف الصحي بالفيوم' },
      { name: 'مياة المنوفية' },
      { name: 'مياة الجيزة' },
      { name: 'مياه قنا' },
      { name: 'شركة مياه المنيا' },
      { name: 'مياه أسيوط والوادي الجديد' },
    ],
  },
  {
    name: 'فواتير الغاز',
    icon: 'fas fa-fire',
    items: [
      { name: 'شركة طاقه للغاز' },
      { name: 'بتروتريد للغاز - دفع جزئي للفواتير' },
      { name: 'فاتورة ناتجاس' },
      { name: 'تحصيل أقساط غازتك' },
      { name: 'مدفوعات ماستر جاز' },
      { name: 'تحصيلات اوفر سيز للغاز' },
      { name: 'اقساط کار جاز' },
      { name: 'غاز NatGas ناتجاز' },
      { name: 'تحصيلات اوفر سيز للغاز (إجمالي)' },
      { name: 'غاز بتروتريد' },
    ],
  },
  {
    name: 'كروت المرافق',
    icon: 'fas fa-credit-card',
    items: [],
    type: 'reader',
  },
];